## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         RESOURCE                         |
|----------|----------------------------------------------------------|
| update   | `module.superset_db.aws_security_group_rule.rds_egress`  |
|          | `module.superset_db.aws_security_group_rule.rds_ingress` |
| recreate | `aws_ecs_task_definition.superset_upgrade`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.superset_upgrade must be replaced
-/+ resource "aws_ecs_task_definition" "superset_upgrade" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade:35" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/superset-upgrade" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ linuxParameters  = {
                      ~ capabilities = {
                          - add  = []
                            # (1 unchanged attribute hidden)
                        }
                    }
                  - mountPoints      = []
                    name             = "superset-upgrade"
                  - systemControls   = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "superset-upgrade" -> (known after apply)
      ~ revision                 = 35 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_db.aws_cloudwatch_log_group.proxy has moved to module.superset_db.aws_cloudwatch_log_group.proxy[0]
    resource "aws_cloudwatch_log_group" "proxy" {
        id                = "/aws/rds/proxy/superset-prod-proxy"
        name              = "/aws/rds/proxy/superset-prod-proxy"
        tags              = {
            "CostCentre" = "cds-superset-prod"
            "Name"       = "superset-prod_proxy_logs"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.superset_db.aws_db_proxy.proxy has moved to module.superset_db.aws_db_proxy.proxy[0]
    resource "aws_db_proxy" "proxy" {
        id                     = "superset-prod-proxy"
        name                   = "superset-prod-proxy"
        tags                   = {
            "CostCentre" = "cds-superset-prod"
            "Name"       = "superset-prod-rds-proxy"
            "Terraform"  = "true"
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_db.aws_db_proxy_default_target_group.this has moved to module.superset_db.aws_db_proxy_default_target_group.this[0]
    resource "aws_db_proxy_default_target_group" "this" {
        id            = "superset-prod-proxy"
        name          = "default"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.superset_db.aws_db_proxy_target.target has moved to module.superset_db.aws_db_proxy_target.target[0]
    resource "aws_db_proxy_target" "target" {
        id                    = "superset-prod-proxy/default/TRACKED_CLUSTER/superset-prod-cluster"
        # (9 unchanged attributes hidden)
    }

  # module.superset_db.aws_iam_policy.read_connection_string has moved to module.superset_db.aws_iam_policy.read_connection_string[0]
    resource "aws_iam_policy" "read_connection_string" {
        id               = "arn:aws:iam::066023111852:policy/superset-prodReadConnectionString"
        name             = "superset-prodReadConnectionString"
        tags             = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.superset_db.aws_iam_role.rds_proxy has moved to module.superset_db.aws_iam_role.rds_proxy[0]
    resource "aws_iam_role" "rds_proxy" {
        id                    = "superset-prod_rds_proxy"
        name                  = "superset-prod_rds_proxy"
        tags                  = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)
    }

  # module.superset_db.aws_iam_role_policy_attachment.read_connection_string has moved to module.superset_db.aws_iam_role_policy_attachment.read_connection_string[0]
    resource "aws_iam_role_policy_attachment" "read_connection_string" {
        id         = "superset-prod_rds_proxy-20240116143756346700000001"
        # (2 unchanged attributes hidden)
    }

  # module.superset_db.aws_secretsmanager_secret.connection_string has moved to module.superset_db.aws_secretsmanager_secret.connection_string[0]
    resource "aws_secretsmanager_secret" "connection_string" {
        id                             = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-jNUoVF"
        name                           = "superset-prod-qo0bor"
        tags                           = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.superset_db.aws_secretsmanager_secret.proxy_connection_string has moved to module.superset_db.aws_secretsmanager_secret.proxy_connection_string[0]
    resource "aws_secretsmanager_secret" "proxy_connection_string" {
        id                             = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-proxy-connection-string-7P0aoE"
        name                           = "superset-prod-qo0bor-proxy-connection-string"
        tags                           = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # module.superset_db.aws_secretsmanager_secret_version.connection_string has moved to module.superset_db.aws_secretsmanager_secret_version.connection_string[0]
    resource "aws_secretsmanager_secret_version" "connection_string" {
        id             = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-jNUoVF|37CCC3E2-423A-44D1-BEC6-274F4027EB3A"
        # (6 unchanged attributes hidden)
    }

  # module.superset_db.aws_secretsmanager_secret_version.proxy_connection_string has moved to module.superset_db.aws_secretsmanager_secret_version.proxy_connection_string[0]
    resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
        id             = "arn:aws:secretsmanager:ca-central-1:066023111852:secret:superset-prod-qo0bor-proxy-connection-string-7P0aoE|44879C38-B784-4E99-9A5E-25CAF08DC3B9"
        # (6 unchanged attributes hidden)
    }

  # module.superset_db.aws_security_group.rds_proxy has moved to module.superset_db.aws_security_group.rds
    resource "aws_security_group" "rds" {
        id                     = "sg-0ce315927c04bb093"
        name                   = "superset-prod_rds_proxy_sg"
        tags                   = {
            "CostCentre" = "cds-superset-prod"
            "Name"       = "superset-prod_rds_proxy_sg"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # module.superset_db.aws_security_group_rule.rds_egress will be updated in-place
  # (moved from module.superset_db.aws_security_group_rule.rds_proxy_egress)
  ~ resource "aws_security_group_rule" "rds_egress" {
      ~ description            = "Proxy egress from the database" -> "Egress from the database"
        id                     = "sgrule-1579581390"
        # (10 unchanged attributes hidden)
    }

  # module.superset_db.aws_security_group_rule.rds_ingress will be updated in-place
  # (moved from module.superset_db.aws_security_group_rule.rds_proxy_ingress)
  ~ resource "aws_security_group_rule" "rds_ingress" {
      ~ description            = "Proxy ingress to the database" -> "Ingress to the database"
        id                     = "sgrule-2307461475"
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.notify_data_export.aws_s3_bucket.this,
  on .terraform/modules/notify_data_export/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.notify"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.data_export"]
WARN - plan.json - main - Missing Common Tags: ["module.superset-redis.aws_elasticache_subnet_group.default"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
